SOPs/taxonomyUpdate.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 18 May. 2022 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NCBI Taxonomy Update</title>
<meta name="author" content="John Brestelli" />
<meta name="description" content="NCBI Taxonomy Update" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">NCBI Taxonomy Update</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org166055b">wget NCBI Taxonomy</a></li>
<li><a href="#orgfb6cba0">Environment</a></li>
<li><a href="#org0dbee27">GUS::Supported::Plugin::LoadTaxon</a></li>
<li><a href="#org07b75ed">Apply Patches</a>
<ul>
<li><a href="#orgd4c8f7f">GiardiaDB</a></li>
<li><a href="#orgcf56e64">FungiDB</a></li>
<li><a href="#orgdc3a5a6">CryptoDB</a></li>
<li><a href="#org92dc8bf">MicrosporidiaDB</a></li>
<li><a href="#org4af2a5a">PlasmoDB</a></li>
<li><a href="#orgffef91a">TriTrypDB</a></li>
<li><a href="#orgc8ca95f">VectorBase</a></li>
</ul>
</li>
<li><a href="#orgc7bd1fa">Run Tuning Manager https://tm.apidb.org</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org166055b" class="outline-2">
<h2 id="org166055b">wget NCBI Taxonomy</h2>
<div class="outline-text-2" id="text-org166055b">
<p>
get and unpack ncbi taxonomy files in temporary directory
</p>
<div class="org-src-container">
<pre class="src src-example">wget --directory-prefix=$PWD \\
     --output-file=wget.log \\
     --tries=5 \\
     --mirror \\
     --no-parent \\
     --no-directories \\
     --no-host-directories \\
     --cut-dirs=2 \\
     --include list \\
     --accept=taxdump.tar.gz "ftp://ftp.ncbi.nih.gov/pub/taxonomy/"
tar -xzf taxdump.tar.gz 
</pre>
</div>
</div>
</section>
<section id="outline-container-orgfb6cba0" class="outline-2">
<h2 id="orgfb6cba0">Environment</h2>
<div class="outline-text-2" id="text-orgfb6cba0">
<p>
The plugin uses GUS Model objects to update rows in SRes.Taxon, SRes.TaxonName and SRes.GeneticCode.  To update a GUSRow object, you must either be the owner of the row, same group as the owner, or the row must have other_write=1.
</p>

<p>
The safest option is to update these 3 tables and set other_write=1
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> sres.taxon <span class="org-keyword">set</span> other_write = 1;
<span class="org-keyword">update</span> sres.taxonname <span class="org-keyword">set</span> other_write = 1;
<span class="org-keyword">update</span> sres.geneticcode <span class="org-keyword">set</span> other_write = 1;
<span class="org-keyword">commit</span>;
</pre>
</div>

<p>
If you don&rsquo;t set the other_write=1 you must either a) ensure there is only one &ldquo;group&rdquo; for these tables AND check that your user is linked to the group AND this group is set as the group in gus.config
</p>
<div class="org-src-container">
<pre class="src src-sql">  <span class="org-comment">-- ensure there is only one "group" for these tables</span>
  <span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> core.groupinfo gi <span class="org-keyword">where</span> group_id <span class="org-keyword">in</span> (
   <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_group_id <span class="org-keyword">from</span> sres.taxon
   <span class="org-keyword">union</span>
   <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_group_id <span class="org-keyword">from</span> sres.taxonname
   <span class="org-keyword">union</span>
   <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_group_id <span class="org-keyword">from</span> sres.geneticcode);

 <span class="org-comment">-- ensure your user is linked to the same group </span>
   <span class="org-keyword">select</span> gi.<span class="org-keyword">name</span>
  <span class="org-keyword">from</span> core.groupinfo gi, core.userinfo ui, core.usergroup ug
  <span class="org-keyword">where</span> ui.login = <span class="org-string">'jbrestel'</span>
  <span class="org-keyword">and</span> ui.user_id = ug.user_id
  <span class="org-keyword">and</span> ug.group_id = gi.group_id

<span class="org-comment">-- Make sure that this group is set in your gus.config</span>
</pre>
</div>

<p>
OR b) ensure that your user is the ONLY owner of the rows in these 3 tables
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> login <span class="org-keyword">from</span> core.userinfo gi <span class="org-keyword">where</span> user_id <span class="org-keyword">in</span> (
 <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_user_id <span class="org-keyword">from</span> sres.taxon
 <span class="org-keyword">union</span>
 <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_user_id <span class="org-keyword">from</span> sres.taxonname
 <span class="org-keyword">union</span>
 <span class="org-keyword">select</span> <span class="org-keyword">distinct</span> row_user_id <span class="org-keyword">from</span> sres.geneticcode)
</pre>
</div>
</div>
</section>


<section id="outline-container-org0dbee27" class="outline-2">
<h2 id="org0dbee27">GUS::Supported::Plugin::LoadTaxon</h2>
<div class="outline-text-2" id="text-org0dbee27">
<div class="org-src-container">
<pre class="src src-example">ga GUS::Supported::Plugin::LoadTaxon \\
  --names $PWD/names.dmp \\
  --nodes $PWD/nodes.dmp \\
  --gencode $PWD/gencode.dmp \\
  --merged $PWD/merged.dmp \\
  --verbose \\
  --commit
</pre>
</div>
</div>
</section>
