SOPs/taxonomyUpdate.org
** GiardiaDB
  In sql developer run the following sql command:


#+begin_src sql
  --Check for temporary ncbi tax ids
  select * 
  from sres.taxon 
  where ncbi_tax_id in (9100000002,9100000003);
#+end_src

Load the temporary rows if the 2 above do not exist
#+begin_src bash
    ga GUS::Supported::Plugin::InsertTaxonAndTaxonName --parentNcbiTaxId 5740 \\
                                                       --parentRank genus \\
                                                       --ncbiTaxId 9100000002 \\
                                                       --rank 'species' \\
                                                       --name 'Giardia Assemblage B' \\
                                                       --nameClass 'scientific name' \\
                                                       --geneticCodeId 2 \\
                                                       --mitochondrialGeneticCodeId 1 \\
                                                       --commit >> error.log 2>&1 &

    ga GUS::Supported::Plugin::InsertTaxonAndTaxonName --parentNcbiTaxId 5740 \\
                                                       --parentRank genus \\
                                                       --ncbiTaxId 9100000003 \\
                                                       --rank 'species' \\
                                                       --name 'Giardia Assemblage E' \\
                                                       --nameClass 'scientific name' \\
                                                       --geneticCodeId 2 \\
                                                       --mitochondrialGeneticCodeId 1 \\
                                                       --commit >> error.log 2>&1
  #+end_src

  #+begin_src sql
  update sres.taxonname 
  set name='Giardia Assemblage A isolate WB' 
  where name='Giardia lamblia ATCC 50803' 
  and name_class = 'scientific name';

  update sres.taxonname 
  set name='Giardia Assemblage B isolate GS' 
  where name='Giardia intestinalis ATCC 50581' 
  and name_class = 'scientific name';

  update sres.taxonname 
  set name='Giardia Assemblage E isolate P15' 
  where name='Giardia lamblia P15' 
  and name_class = 'scientific name';

  update sres.taxonname 
  set name='Giardia Assemblage A' 
  where name='Giardia intestinalis' 
  and name_class = 'scientific name';

  update sres.taxon
  set rank = 'strain'
  where ncbi_tax_id in (184922,598745,658858);


  update sres.taxon 
  set parent_id=(select taxon_id 
                 from sres.taxonname 
                 where name_class='scientific name' 
                 and name='Giardia Assemblage B') 
  where ncbi_tax_id=598745;

  update sres.taxon 
  set parent_id=(select taxon_id 
                 from sres.taxonname 
                 where name_class='scientific name' 
                 and name='Giardia Assemblage E') 
  where ncbi_tax_id=658858;

  update sres.TaxonName 
  set name='Giardia intestinalis' 
  where name='Lamblia intestinalis';
  #+end_src

** FungiDB
  #+begin_src sql
  update SRES.TAXONNAME 
  set name_class='synonym' 
  where NAME='[Candida] glabrata CBS 138';

  update SRES.TAXONNAME 
  set name_class='scientific name' 
  where NAME='Candida glabrata CBS 138';
  #+end_src

** CryptoDB
  In NCBI taxonomy, 'Cryptosporidium sp. chipmunk LX-2015' is a species now, 
  and it's parent is 'unclassified Cryptosporidium', which is not what we loaded before.
  [[https://www.ncbi.nlm.nih.gov/Taxonomy/Browser/wwwtax.cgi]]

  Actually 'chipmunk LX-2015' is a strain, NCBI taxonomy puts it as species name.
  [[https://gold.jgi.doe.gov/organism?id=Go0113979]]

  Based on what discussed with Omar in slack, 
  re-set the rank of 'Cryptosporidium sp. chipmunk LX-2015' as strain
  re-set the parent of it as 'Cryptosporidium sp.', not 'unclassified Cryptosporidium'

  #+begin_src sql
  update sres.taxon 
  set rank = 'strain' 
  where NCBI_TAX_ID=1603071;

  update sres.taxon 
  set parent_id=(select taxon_id 
                 from sres.taxonname 
                 where name_class='scientific name' 
                 and name='Cryptosporidium sp.') 
  where NCBI_TAX_ID=1603071;
  #+end_src


** MicrosporidiaDB

  patch micr-rbld to set "Amphiamblys sp. WSBS2006" as strain (rank='no rank'), 
  and its parent "unclassified Amphiamblys" as species (rank='species')
  To be consistent, also set "Amphiamblys sp. WSBS2011" as strain

  #+begin_src sql
  update sres.taxon set rank = 'no rank' where NCBI_TAX_ID=1866961;
  update sres.taxon set rank = 'species' where NCBI_TAX_ID=2641285;
  update sres.taxon set rank = 'no rank' where NCBI_TAX_ID=1892499;
  #+end_src

