SOPs/taxonomyUpdate.html

<section id="outline-container-org07b75ed" class="outline-2">
<h2 id="org07b75ed">Apply Patches</h2>
<div class="outline-text-2" id="text-org07b75ed">
</div>
<div id="outline-container-orgd4c8f7f" class="outline-3">
<h3 id="orgd4c8f7f">GiardiaDB</h3>
<div class="outline-text-3" id="text-orgd4c8f7f">
<p>
In sql developer run the following sql command:
</p>


<div class="org-src-container">
<pre class="src src-sql"><span class="org-comment">--Check for temporary ncbi tax ids</span>
<span class="org-keyword">select</span> * 
<span class="org-keyword">from</span> sres.taxon 
<span class="org-keyword">where</span> ncbi_tax_id <span class="org-keyword">in</span> (9100000002,9100000003);
</pre>
</div>

<p>
Load the temporary rows if the 2 above do not exist
</p>
<div class="org-src-container">
<pre class="src src-bash">ga GUS::Supported::Plugin::InsertTaxonAndTaxonName --parentNcbiTaxId 5740 <span class="org-string">\\</span>
                                                   --parentRank genus <span class="org-string">\\</span>
                                                   --ncbiTaxId 9100000002 <span class="org-string">\\</span>
                                                   --rank <span class="org-string">'species'</span> <span class="org-string">\\</span>
                                                   --name <span class="org-string">'Giardia Assemblage B'</span> <span class="org-string">\\</span>
                                                   --nameClass <span class="org-string">'scientific name'</span> <span class="org-string">\\</span>
                                                   --geneticCodeId 2 <span class="org-string">\\</span>
                                                   --mitochondrialGeneticCodeId 1 <span class="org-string">\\</span>
                                                   --commit &gt;&gt; error.log 2&gt;&amp;1 &amp;

ga GUS::Supported::Plugin::InsertTaxonAndTaxonName --parentNcbiTaxId 5740 <span class="org-string">\\</span>
                                                   --parentRank genus <span class="org-string">\\</span>
                                                   --ncbiTaxId 9100000003 <span class="org-string">\\</span>
                                                   --rank <span class="org-string">'species'</span> <span class="org-string">\\</span>
                                                   --name <span class="org-string">'Giardia Assemblage E'</span> <span class="org-string">\\</span>
                                                   --nameClass <span class="org-string">'scientific name'</span> <span class="org-string">\\</span>
                                                   --geneticCodeId 2 <span class="org-string">\\</span>
                                                   --mitochondrialGeneticCodeId 1 <span class="org-string">\\</span>
                                                   --commit &gt;&gt; error.log 2&gt;&amp;1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage A isolate WB'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia lamblia ATCC 50803'</span> 
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific name'</span>;

<span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage B isolate GS'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia intestinalis ATCC 50581'</span> 
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific name'</span>;

<span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage E isolate P15'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia lamblia P15'</span> 
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific name'</span>;

<span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage A'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia intestinalis'</span> 
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific name'</span>;

<span class="org-keyword">update</span> sres.taxon
<span class="org-keyword">set</span> rank = <span class="org-string">'strain'</span>
<span class="org-keyword">where</span> ncbi_tax_id <span class="org-keyword">in</span> (184922,598745,658858);


<span class="org-keyword">update</span> sres.taxon 
<span class="org-keyword">set</span> parent_id=(<span class="org-keyword">select</span> taxon_id 
               <span class="org-keyword">from</span> sres.taxonname 
               <span class="org-keyword">where</span> name_class=<span class="org-string">'scientific name'</span> 
               <span class="org-keyword">and</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage B'</span>) 
<span class="org-keyword">where</span> ncbi_tax_id=598745;

<span class="org-keyword">update</span> sres.taxon 
<span class="org-keyword">set</span> parent_id=(<span class="org-keyword">select</span> taxon_id 
               <span class="org-keyword">from</span> sres.taxonname 
               <span class="org-keyword">where</span> name_class=<span class="org-string">'scientific name'</span> 
               <span class="org-keyword">and</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia Assemblage E'</span>) 
<span class="org-keyword">where</span> ncbi_tax_id=658858;

<span class="org-keyword">update</span> sres.TaxonName 
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Giardia intestinalis'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span>=<span class="org-string">'Lamblia intestinalis'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf56e64" class="outline-3">
<h3 id="orgcf56e64">FungiDB</h3>
<div class="outline-text-3" id="text-orgcf56e64">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> SRES.TAXONNAME 
<span class="org-keyword">set</span> name_class=<span class="org-string">'synonym'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">NAME</span>=<span class="org-string">'[Candida] glabrata CBS 138'</span>;

<span class="org-keyword">update</span> SRES.TAXONNAME 
<span class="org-keyword">set</span> name_class=<span class="org-string">'scientific name'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">NAME</span>=<span class="org-string">'Candida glabrata CBS 138'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc3a5a6" class="outline-3">
<h3 id="orgdc3a5a6">CryptoDB</h3>
<div class="outline-text-3" id="text-orgdc3a5a6">
<p>
In NCBI taxonomy, &rsquo;Cryptosporidium sp. chipmunk LX-2015&rsquo; is a species now, 
and it&rsquo;s parent is &rsquo;unclassified Cryptosporidium&rsquo;, which is not what we loaded before.
<a href="https://www.ncbi.nlm.nih.gov/Taxonomy/Browser/wwwtax.cgi">https://www.ncbi.nlm.nih.gov/Taxonomy/Browser/wwwtax.cgi</a>
</p>

<p>
Actually &rsquo;chipmunk LX-2015&rsquo; is a strain, NCBI taxonomy puts it as species name.
<a href="https://gold.jgi.doe.gov/organism?id=Go0113979">https://gold.jgi.doe.gov/organism?id=Go0113979</a>
</p>

<p>
Based on what discussed with Omar in slack, 
re-set the rank of &rsquo;Cryptosporidium sp. chipmunk LX-2015&rsquo; as strain
re-set the parent of it as &rsquo;Cryptosporidium sp.&rsquo;, not &rsquo;unclassified Cryptosporidium&rsquo;
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> sres.taxon 
<span class="org-keyword">set</span> rank = <span class="org-string">'strain'</span> 
<span class="org-keyword">where</span> NCBI_TAX_ID=1603071;

<span class="org-keyword">update</span> sres.taxon 
<span class="org-keyword">set</span> parent_id=(<span class="org-keyword">select</span> taxon_id 
               <span class="org-keyword">from</span> sres.taxonname 
               <span class="org-keyword">where</span> name_class=<span class="org-string">'scientific name'</span> 
               <span class="org-keyword">and</span> <span class="org-keyword">name</span>=<span class="org-string">'Cryptosporidium sp.'</span>) 
<span class="org-keyword">where</span> NCBI_TAX_ID=1603071;
</pre>
</div>
</div>
</div>


<div id="outline-container-org92dc8bf" class="outline-3">
<h3 id="org92dc8bf">MicrosporidiaDB</h3>
<div class="outline-text-3" id="text-org92dc8bf">
<p>
patch micr-rbld to set &ldquo;Amphiamblys sp. WSBS2006&rdquo; as strain (rank=&rsquo;no rank&rsquo;), 
and its parent &ldquo;unclassified Amphiamblys&rdquo; as species (rank=&rsquo;species&rsquo;)
To be consistent, also set &ldquo;Amphiamblys sp. WSBS2011&rdquo; as strain
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> sres.taxon <span class="org-keyword">set</span> rank = <span class="org-string">'no rank'</span> <span class="org-keyword">where</span> NCBI_TAX_ID=1866961;
<span class="org-keyword">update</span> sres.taxon <span class="org-keyword">set</span> rank = <span class="org-string">'species'</span> <span class="org-keyword">where</span> NCBI_TAX_ID=2641285;
<span class="org-keyword">update</span> sres.taxon <span class="org-keyword">set</span> rank = <span class="org-string">'no rank'</span> <span class="org-keyword">where</span> NCBI_TAX_ID=1892499;
</pre>
</div>
</div>
</div>
