SOPs/taxonomyUpdate.org
** PlasmoDB


-- these are wrong
  LaveraniaOrganismNames:
  #+begin_src sql
  update SRES.TAXONNAME 
  set name ='Plasmodium praefalciparum' 
  where TAXON_ID= (select taxon_id 
                   from sres.taxon 
                   where ncbi_tax_id = 880534) 
  and NAME_CLASS='scientific name';                                                                                     

  update SRES.TAXONNAME 
  set name ='Plasmodium blacklocki' 
  where TAXON_ID= (select taxon_id 
                   from sres.taxon 
                   where ncbi_tax_id = 880536) 
  and NAME_CLASS='scientific name'; 

  update SRES.TAXONNAME 
  set name ='Plasmodium adleri' 
  where TAXON_ID= (select taxon_id 
                   from sres.taxon 
                   where ncbi_tax_id = 880535) 
  and NAME_CLASS='scientific name'; 

  update sres.taxonname 
  set NAME_CLASS= 'synonym' 
  where name = 'Plasmodium sp. DRC-Itaito';                                                                                                  
  
  update sres.taxonname 
  set NAME_CLASS= 'scientific name' 
  where name = 'Plasmodium billcollinsi';

  --Povale
  update SRES.TAXON 
  set rank = 'species' 
  where NCBI_TAX_ID=864141;

  update SRES.TAXON 
  set rank = 'no rank' 
  where NCBI_TAX_ID=36330;
  #+end_src

** TriTrypDB
  taxonName4tcruDm28c2014:
  reset scientific name of "Trypanosoma cruzi Dm28c" to "Trypanosoma cruzi Dm28c 2014", 
#+begin_src sql
  update SRES.TAXONNAME
  set name='Trypanosoma cruzi Dm28c 2014'
  where TAXON_ID=(select TAXON_ID
                  from sres.taxon
                  where NCBI_TAX_ID=1416333)
  and name_class = 'scientific_name'
#+end_src

taxonName4lspMARLEM2494:
reconstructure ncbi Taxonomy tree,
Leishmania sp. MAR LEM2494 => no rank
unclassified Leishmania => species

#+begin_src sql
update SRES.TAXON set rank='no rank' where NCBI_TAX_ID=1303197;
update SRES.TAXON set rank='species' where NCBI_TAX_ID=40283;
#+end_src
** VectorBase

organismFullNameChange4aalbFPA_and_csonPIR-s-3:
1. change organismFullName from 'Culicoides sonorensis strain PIR-s-3' to 'Culicoides sonorensis strain PIR-s-3'
2. change organismFullName from 'Aedes albopictus isolate FPA' to 'Aedes albopictus Foshan FPA'
3. organismFullNameChange4agamPEST

#+begin_src sql
update SRES.TAXONNAME
set name = 'Culicoides sonorensis PIR-s-3'
where name = 'Culicoides sonorensis strain PIR-s-3'
and name_class = 'scientific name';

update SRES.TAXONNAME
set name = 'Aedes albopictus Foshan FPA'
where name = 'Aedes albopictus isolate FPA';

update sres.taxonname
set NAME_CLASS='synonym'
where name = 'Anopheles gambiae str. PEST';

update sres.taxonname
set NAME_CLASS='scientific name'
where name = 'Anopheles gambiae PEST';
#+end_src



* Run Tuning Manager [[https://tm.apidb.org]]


   

