SOPs/taxonomyUpdate.html

<div id="outline-container-org4af2a5a" class="outline-3">
<h3 id="org4af2a5a">PlasmoDB</h3>
<div class="outline-text-3" id="text-org4af2a5a">
<p>
&#x2013; these are wrong
  LaveraniaOrganismNames:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> SRES.TAXONNAME 
<span class="org-keyword">set</span> <span class="org-keyword">name</span> =<span class="org-string">'Plasmodium praefalciparum'</span> 
<span class="org-keyword">where</span> TAXON_ID= (<span class="org-keyword">select</span> taxon_id 
                 <span class="org-keyword">from</span> sres.taxon 
                 <span class="org-keyword">where</span> ncbi_tax_id = 880534) 
<span class="org-keyword">and</span> NAME_CLASS=<span class="org-string">'scientific name'</span>;                                                                                     

<span class="org-keyword">update</span> SRES.TAXONNAME 
<span class="org-keyword">set</span> <span class="org-keyword">name</span> =<span class="org-string">'Plasmodium blacklocki'</span> 
<span class="org-keyword">where</span> TAXON_ID= (<span class="org-keyword">select</span> taxon_id 
                 <span class="org-keyword">from</span> sres.taxon 
                 <span class="org-keyword">where</span> ncbi_tax_id = 880536) 
<span class="org-keyword">and</span> NAME_CLASS=<span class="org-string">'scientific name'</span>; 

<span class="org-keyword">update</span> SRES.TAXONNAME 
<span class="org-keyword">set</span> <span class="org-keyword">name</span> =<span class="org-string">'Plasmodium adleri'</span> 
<span class="org-keyword">where</span> TAXON_ID= (<span class="org-keyword">select</span> taxon_id 
                 <span class="org-keyword">from</span> sres.taxon 
                 <span class="org-keyword">where</span> ncbi_tax_id = 880535) 
<span class="org-keyword">and</span> NAME_CLASS=<span class="org-string">'scientific name'</span>; 

<span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> NAME_CLASS= <span class="org-string">'synonym'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Plasmodium sp. DRC-Itaito'</span>;                                                                                                  

<span class="org-keyword">update</span> sres.taxonname 
<span class="org-keyword">set</span> NAME_CLASS= <span class="org-string">'scientific name'</span> 
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Plasmodium billcollinsi'</span>;

<span class="org-comment">--Povale</span>
<span class="org-keyword">update</span> SRES.TAXON 
<span class="org-keyword">set</span> rank = <span class="org-string">'species'</span> 
<span class="org-keyword">where</span> NCBI_TAX_ID=864141;

<span class="org-keyword">update</span> SRES.TAXON 
<span class="org-keyword">set</span> rank = <span class="org-string">'no rank'</span> 
<span class="org-keyword">where</span> NCBI_TAX_ID=36330;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffef91a" class="outline-3">
<h3 id="orgffef91a">TriTrypDB</h3>
<div class="outline-text-3" id="text-orgffef91a">
<p>
taxonName4tcruDm28c2014:
reset scientific name of &ldquo;Trypanosoma cruzi Dm28c&rdquo; to &ldquo;Trypanosoma cruzi Dm28c 2014&rdquo;, 
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> SRES.TAXONNAME
<span class="org-keyword">set</span> <span class="org-keyword">name</span>=<span class="org-string">'Trypanosoma cruzi Dm28c 2014'</span>
<span class="org-keyword">where</span> TAXON_ID=(<span class="org-keyword">select</span> TAXON_ID
                <span class="org-keyword">from</span> sres.taxon
                <span class="org-keyword">where</span> NCBI_TAX_ID=1416333)
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific_name'</span>
</pre>
</div>

<p>
taxonName4lspMARLEM2494:
reconstructure ncbi Taxonomy tree,
Leishmania sp. MAR LEM2494 =&gt; no rank
unclassified Leishmania =&gt; species
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> SRES.TAXON <span class="org-keyword">set</span> rank=<span class="org-string">'no rank'</span> <span class="org-keyword">where</span> NCBI_TAX_ID=1303197;
<span class="org-keyword">update</span> SRES.TAXON <span class="org-keyword">set</span> rank=<span class="org-string">'species'</span> <span class="org-keyword">where</span> NCBI_TAX_ID=40283;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc8ca95f" class="outline-3">
<h3 id="orgc8ca95f">VectorBase</h3>
<div class="outline-text-3" id="text-orgc8ca95f">
<p>
organismFullNameChange4aalbFPA_and_csonPIR-s-3:
</p>
<ol class="org-ol">
<li>change organismFullName from &rsquo;Culicoides sonorensis strain PIR-s-3&rsquo; to &rsquo;Culicoides sonorensis strain PIR-s-3&rsquo;</li>
<li>change organismFullName from &rsquo;Aedes albopictus isolate FPA&rsquo; to &rsquo;Aedes albopictus Foshan FPA&rsquo;</li>
<li>organismFullNameChange4agamPEST</li>
</ol>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> SRES.TAXONNAME
<span class="org-keyword">set</span> <span class="org-keyword">name</span> = <span class="org-string">'Culicoides sonorensis PIR-s-3'</span>
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Culicoides sonorensis strain PIR-s-3'</span>
<span class="org-keyword">and</span> name_class = <span class="org-string">'scientific name'</span>;

<span class="org-keyword">update</span> SRES.TAXONNAME
<span class="org-keyword">set</span> <span class="org-keyword">name</span> = <span class="org-string">'Aedes albopictus Foshan FPA'</span>
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Aedes albopictus isolate FPA'</span>;

<span class="org-keyword">update</span> sres.taxonname
<span class="org-keyword">set</span> NAME_CLASS=<span class="org-string">'synonym'</span>
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Anopheles gambiae str. PEST'</span>;

<span class="org-keyword">update</span> sres.taxonname
<span class="org-keyword">set</span> NAME_CLASS=<span class="org-string">'scientific name'</span>
<span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Anopheles gambiae PEST'</span>;
</pre>
</div>
</div>
</div>
</section>



<section id="outline-container-orgc7bd1fa" class="outline-2">
<h2 id="orgc7bd1fa">Run Tuning Manager <a href="https://tm.apidb.org">https://tm.apidb.org</a></h2>
</section>
</main>
</body>
</html>
